Extensions/бит_Доработки/InformationRegisters/ЮЦАУДлительностьВыезда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЮЦАУДлительностьВыезда</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачалоОбеда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяЗаезда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяВыезда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыхБудн</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮЦАУ_Выходные_праздничные_будни</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатМаршруты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Выезд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮЦАУ_Выезды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Смена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮЦАУ_Смены</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/бит_Доработки/Enums/уатВидыПЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уатВидыПЛ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>_6</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/бит_Доработки/CommonModules/уатПутевыеЛисты/Ext/Module.bsl
// + бит Петянина А.К 20.04.26
Функция ДанныеОбедаПоЗаданию(Задания) Экспорт
	
	Результат = Новый Структура("ДневнойОбед, ВремяОбеда", Истина, 0 );
	
	Если Задания.Количество() = 1 Тогда
		Запрос = Новый Запрос;
        Задание = Задания[0];
		//Установка значений параметров
		Запрос.УстановитьПараметр("Смена", Задание.Смена);
		Запрос.УстановитьПараметр("Маршрут", Задание.Маршрут);
		Запрос.УстановитьПараметр("ДатаПЛ", Задание.ВремяУбытия);
		Запрос.УстановитьПараметр("ВыхБудн", Задание.ВыходныеБудни);
		Запрос.УстановитьПараметр("Выезд", Задание.Выезд);

		Запрос.Текст = "ВЫБРАТЬ
		               |	ЮЦАУДлительностьВыездаСрезПоследних.Длительность КАК Длительность,
		               |	ЮЦАУДлительностьВыездаСрезПоследних.ВремяВыезда КАК ВремяВыезда,
		               |	ЮЦАУДлительностьВыездаСрезПоследних.ВремяЗаезда КАК ВремяЗаезда,
		               |	ВЫБОР
		               |		КОГДА ЮЦАУДлительностьВыездаСрезПоследних.НачалоОбеда >= ДАТАВРЕМЯ(1, 1, 1, 6, 0, 0)
		               |				И ЮЦАУДлительностьВыездаСрезПоследних.НачалоОбеда < ДАТАВРЕМЯ(1, 1, 1, 22, 0, 0)
		               |			ТОГДА ИСТИНА
		               |		ИНАЧЕ ЛОЖЬ
		               |	КОНЕЦ КАК ДневнойОбед
		               |ИЗ
		               |	РегистрСведений.ЮЦАУДлительностьВыезда.СрезПоследних(
		               |			&ДатаПЛ,
		               |			Маршрут = &Маршрут
		               |				И Выезд = &Выезд
		               |				И Смена = &Смена
		               |				И ВыхБудн = &ВыхБудн) КАК ЮЦАУДлительностьВыездаСрезПоследних";

		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Возврат Результат;
		КонецЕсли;

		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			ВыездСек = Выборка.ВремяВыезда - Дата(1,1,1);
			ЗаездСек = Выборка.ВремяЗаезда - Дата(1,1,1); 
			ДлительностьСек = Выборка.Длительность - Дата(1,1,1);
			ВремяОбеда = (ЗаездСек - ВыездСек - ДлительностьСек);
			Если  ЗаездСек < ВыездСек Тогда
				ВремяОбеда = ВремяОбеда + 24 * 3600 ;
			КонецЕсли;
			Результат.ВремяОбеда = ВремяОбеда;
			Результат.ДневнойОбед = Выборка.ДневнойОбед;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДоработатьТЧФОВ(ФактическиОтработанноеВремя, стОбед) Экспорт
	Для каждого СтрокаФОВ ИЗ ФактическиОтработанноеВремя Цикл
		Если стОбед.ДневнойОбед Тогда
			НовоеВремя = СтрокаФОВ.ВремяДневное - стОбед.ВремяОбеда;
			Если НовоеВремя >= 0 Тогда
				СтрокаФОВ.ВремяДневное = НовоеВремя;
				Прервать;
			Иначе
				СтрокаФОВ.ВремяДневное = 0;
				стОбед.ВремяОбеда = -НовоеВремя;
			КонецЕсли;
		Иначе
			НовоеВремя = СтрокаФОВ.ВремяНочное - стОбед.ВремяОбеда;
			Если НовоеВремя >= 0 Тогда
				СтрокаФОВ.ВремяНочное = НовоеВремя;
				Прервать ;
			Иначе
				СтрокаФОВ.ВремяНочное = 0;
				стОбед.ВремяОбеда = -НовоеВремя;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецФункции
// - бит Петянина А.К 20.04.26

&ИзменениеИКонтроль("РасчитатьВременныеПараметры")
Процедура Бит_РасчитатьВременныеПараметры(Объект)
	флЭтоТПЛ = Ложь;
	Если НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД()
		И ТипЗнч(Объект) = Тип("ДокументОбъект.уатТехнологическийПутевойЛист") Тогда
		флЭтоТПЛ = Истина;
	КонецЕсли;

	Если флЭтоТПЛ Тогда
		РежимРаботыТС = Справочники.уатРежимыРаботыТС.ПустаяСсылка();
		тблПростои = Новый ТаблицаЗначений;
	Иначе
		РежимРаботыТС = Объект.РежимРаботыТС;
		тблПростои = Объект.Простои.Выгрузить();
	КонецЕсли;
	
	тблРабочееВремя = РасчетВремени(Объект.ДатаВыезда, Объект.ДатаВозвращения, Объект.Организация, РежимРаботыТС, тблПростои);
		
	// В СТД в ПЛ нет ТЧ ФОВ, поэтому для учета работы сотрудников в выходные и праздники используется отдельная переменная объекта
	РассчитатьВыходныеПраздникиДляСТД(тблРабочееВремя, Объект);

	тблРабочееВремя.Свернуть("ВидВремени, ПростойСВклДвиг", "Продолжительность");

	// работу и ночные часы берем из таблицы рабочего времени, простои тоже
	Объект.мВремяВРаботе = 0;
	Объект.мВремяНочь = 0;
	Объект.мВремяВПростое = 0;
	Объект.мВремяВПростоеСВклДвигателем = 0;
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
		Объект.мВремяДень = 0;
	КонецЕсли;
	Для Каждого ТекСтрокаРабВремя Из тблРабочееВремя Цикл
		Если ТекСтрокаРабВремя.ВидВремени = Справочники.уатВидыИспользованияРабочегоВремени.Явка Тогда
			Объект.мВремяВРаботе = Объект.мВремяВРаботе + ТекСтрокаРабВремя.Продолжительность;
		ИначеЕсли ТекСтрокаРабВремя.ВидВремени = Справочники.уатВидыИспользованияРабочегоВремени.РаботаНочныеЧасы Тогда
			Объект.мВремяНочь = Объект.мВремяНочь + ТекСтрокаРабВремя.Продолжительность;
		ИначеЕсли уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() И ТекСтрокаРабВремя.ВидВремени = "Дневные" Тогда
			Объект.мВремяДень = Объект.мВремяДень + ТекСтрокаРабВремя.Продолжительность;
		ИначеЕсли ТекСтрокаРабВремя.ВидВремени = Справочники.уатВидыИспользованияРабочегоВремени.Простой Тогда
			Если ТекСтрокаРабВремя.ПростойСВклДвиг Тогда
				Объект.мВремяВПростоеСВклДвигателем = Объект.мВремяВПростоеСВклДвигателем + ТекСтрокаРабВремя.Продолжительность;
			Иначе
				Объект.мВремяВПростое = Объект.мВремяВПростое + ТекСтрокаРабВремя.Продолжительность;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	// общее количество дней по ПЛ
	Объект.мКоличествоДней = (НачалоДня(Объект.ДатаВозвращения) - НачалоДня(Объект.ДатаВыезда))/86400 + 1;

	// время в наряде
	Если Объект.ДатаВозвращения - Объект.ДатаВыезда > 86400 Тогда //многодневный ПЛ
		Если ЗначениеЗаполнено(РежимРаботыТС) Тогда
			мПродолжительностьРабочегоДня = РежимРаботыТС.КонецРаботы - РежимРаботыТС.НачалоРаботы;
			Если РежимРаботыТС.НачалоРаботы <= РежимРаботыТС.КонецРаботы Тогда //дневной
				мПродолжительностьРабочегоДня = РежимРаботыТС.КонецРаботы - РежимРаботыТС.НачалоРаботы;
			Иначе //ночной
				мПродолжительностьРабочегоДня = РежимРаботыТС.КонецРаботы + 86400 - РежимРаботыТС.НачалоРаботы;
			КонецЕсли;
		Иначе
			мПродолжительностьРабочегоДня = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Объект.Организация, "ПродолжительностьРабочегоДня") - '00010101';
			Если мПродолжительностьРабочегоДня = 0 Тогда
				мПродолжительностьРабочегоДня = 86400;
			КонецЕсли;
		КонецЕсли;

		Объект.мВремяВНаряде = ?(Объект.ДатаВыезда - НачалоДня(Объект.ДатаВыезда) > 86400 - мПродолжительностьРабочегоДня,
		86400 -	(Объект.ДатаВыезда - НачалоДня(Объект.ДатаВыезда)), мПродолжительностьРабочегоДня)
		+ ?(Объект.ДатаВозвращения - НачалоДня(Объект.ДатаВозвращения) > мПродолжительностьРабочегоДня,
		мПродолжительностьРабочегоДня, Объект.ДатаВозвращения - НачалоДня(Объект.ДатаВозвращения))
		+ мПродолжительностьРабочегоДня*((НачалоДня(Объект.ДатаВозвращения) -
		НачалоДня(Объект.ДатаВыезда))/86400 - 1);
	Иначе //однодневный ПЛ
		Объект.мВремяВНаряде = Объект.ДатаВозвращения - Объект.ДатаВыезда;
	КонецЕсли;
	#Вставка
	// + бит Петянина А.К 20.04.26
	Если Объект.ВидПЛ = Перечисления.уатВидыПЛ._6 Тогда
		стОбед = ДанныеОбедаПоЗаданию(Объект.Задание); 
		ДоработатьТЧФОВ(Объект.ФактическиОтработанноеВремя, стОбед);	
	КонецЕсли;
	// - бит Петянина А.К 20.04.26
	#КонецВставки
КонецПроцедуры
